<a href="https://colab.research.google.com/github/gsepulv1/ST0245-08/blob/master/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

Para conocer la version de pandas

In [2]:
pd.__version__

'1.1.4'

In [3]:
from google.colab import files
uploades = files.upload()

Saving train.csv to train.csv

In [8]:
titanic= pd.read_csv('train.csv', sep=',')

In [9]:
titanic

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

Trabajemos con el famoso conjunto de datos del Titanic. Estos son los campos disponibles:
passengerId: una identificación numérica asignada a cada pasajero
survived: si el pasajero sobrevivió (1) o no (0)
pclass: la clase en la que estaba el pasajero
name el nombre del pasajero
sex: el género del pasajero - hombre o mujer
Age: la edad del pasajero (incluye valores fraccionarios)
sibsp: el número de hermanos y cónyuges que el pasajero tenía a bordo
parch: el número de padres e hijos que el pasajero tenía a bordo
ticket: el número de ticket del pasajero
fare: cuánto pagó el pasajero por el billete
cabin: en qué cabina estaba el pasajero
embarked: Donde el pasajero abordó el Titanic

In [10]:
titanic.index

RangeIndex(start=0, stop=891, step=1)

Que obtienes con index?

Indexadores: loc e iloc
Pandas proporciona algunos atributos de indexación especiales que exponen explícitamente ciertos esquemas de indexación. Estos no son métodos funcionales, sino atributos que exponen una forma particular de recuperar partes de los datos.
El atributo loc permite la indexación y segmentación que siempre se refiere al índice explícito. El atributo iloc permite indexar y segmentar que siempre se refiere al índice implícito de estilo Python. Para ilustrar la diferencia, veamos los ejemplos a continuación. Observe que loc incluye ambos extremos de los rangos especificados y que las columnas se especifican por nombre. Por otro lado, iloc es exclusivo del extremo superior de los rangos especificados, y las columnas se especifican mediante un índice numérico.

In [11]:
titanic.loc[10:15,'PassengerId':'Age']

    PassengerId  Survived  ...     Sex   Age
10           11         1  ...  female   4.0
11           12         1  ...  female  58.0
12           13         0  ...    male  20.0
13           14         0  ...    male  39.0
14           15         0  ...  female  14.0
15           16         1  ...  female  55.0

[6 rows x 6 columns]

In [12]:
titanic.iloc[10:15,0:5]

    PassengerId  Survived  Pclass                                  Name     Sex
10           11         1       3       Sandstrom, Miss. Marguerite Rut  female
11           12         1       1              Bonnell, Miss. Elizabeth  female
12           13         0       3        Saundercock, Mr. William Henry    male
13           14         0       3           Andersson, Mr. Anders Johan    male
14           15         0       3  Vestrom, Miss. Hulda Amanda Adolfina  female

In [13]:
titanic[10:15]

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
10           11         1       3  ...  16.7000    G6         S
11           12         1       1  ...  26.5500  C103         S
12           13         0       3  ...   8.0500   NaN         S
13           14         0       3  ...  31.2750   NaN         S
14           15         0       3  ...   7.8542   NaN         S

[5 rows x 12 columns]

crea un dataframe con los pasajeros entre 18 y 50 años  df1

In [ ]:
df1.reset_index(inplace = True)

In [13]:
df2 = titanic.iloc[10:15,2:5]
df2.reset_index(inplace = True)


**concat ()**
pandas tiene una función, pd.concat (), que tiene una sintaxis similar a np.concatenate pero contiene diferentes argumentos. Se puede utilizar para una simple concatenación de Series o DataFrames

In [ ]:
pd.concat([df1, df2],sort=True, axis=1)

In [ ]:
pd.concat([df1, df2],ignore_index=True,sort=True, axis=0)

SyntaxError: ignored

**merge() and join()**
Estas funciones permiten que los datos de diferentes dataframes se combinen en uno de acuerdo con una regla de "cruce" o "búsqueda".
La función merge () es la función pandas predeterminada para fusionar datos. Básicamente es la contraparte de SQL JOINs de pandas, y requiere especificar qué columnas de ambos DataFrames se compararán. merge () no se preocupa en absoluto por los índices definidos en ellos.
Por otro lado, join () básicamente está haciendo una fusión pero aprovechando los índices de ambos DataFrames.
La siguiente figura resume los diferentes 4 tipos de JOIN: interno, externo, izquierdo y derecho.
(http://www.datasciencemadesimple.com/wp-content/uploads/2017/09/join-or-merge-in-python-pandas-1.png)

 La sintaxis básica es:
 new_joined_df = df.merge (another_df, left_on = "col_in_df", right_on = "col_in_another_df",
                          how="inner"|"left"|"right"|"outer")